TOKEN = "7974113152:AAFCvljBO3mI1Ukf_v8erXxmq4JVIy2Jo1E"
SUBGRAM_TOKEN = "01efdfcdd7e9dcaac3c8f659d4b18704067c9f3438a9d2f70b2110615a4da1cc"
FLYER_TOKEN = "FL-FEFHHM-xAIyYc-skEJBv-KElIRM"

admins_id = [
    5184742443,
    6904423555
]

ALLOWED_LANGUAGE_CODES = {"uk", "be", "uz", "ru"} # Допустимые языки (ДЛЯ ПВО ПРОТИВ БОТОВ)

admin_url = "https://t.me/lound_ceo" # ссылка на админа

stars_reffer = [100] # награда за реферала
stars_to_withdraw = [15] # необходимое кол-во звезд для вывода
photos_to_withdraw = [0] # необходимое кол-во проданных фото для вывода

subgram_status = [True] # статус вызова subgram на кнопки
flyer_status = [True] # статус вызова flyer на кнопки / start

channel_osn = "https://t.me/geghl" #Основной канал (ссылка)

channel_withdraw = "https://t.me/geghl" #Канал вывода (ссылка)
chahnel_withdraw_id = -1002227481191 #ID канала вывода

chater = "https://t.me/sadfsdadsfsdfd" #Чат (ссылка)

mini_games = [
    10, # Мини-Игра [Слоты] (Стоимость прокрута в звёздах)
]

reward_games = {
    "slots": {
        "reward_table": {
            1: 10,   # Выпало - 💎💎💎 (Награда: 10)
            22: 10,  # Выпало - 🍋🍋🍋 (Награда: 10)
            43: 10,  # Выпало - 🔔🔔🔔 (Награда: 10)
            64: 10   # Выпало - ⭐️⭐️⭐️ (Награда: 10)
        },
        "default_reward": 0  # если выпала обычная комбинация — ничего
    }
}
